app/controllers/users_controller.rb

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "dragon@yahoo.com"], ["password_digest", "$2a$10$U.tmWuS0tb9o.6.OHLOMUuII4B5GArd1AJ7Tr8WcW3dHuCHFyM4AK"], ["updated_at", "2017-08-13 19:09:11.093470"], ["id", 2]]

  def destory
    User.find(params[:id]).destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 221]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 221], ["LIMIT", 1]]